app/views/songs/index.html.erb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
  <li><%= link_to song.title, song_path(song) %>
    <% if song.artist.present? %>